<?php

use Illuminate\Database\Seeder;

class DatabaseSeeder extends Seeder
{
    /**
     * Seed the application's database.
     *
     * @return void
     */
    public function run()
    {
        $districts_names=["حي العزيزية",
        "حي الملك فهد",
        "حي الربوة",
        "حي سيد الشهداء",
        "حي قباء",
        "حي العنابس",
        "حي السحمان",
        "حي المستراح",
        "حي البحر",
        "حي الجبور",
        "حي النصر",
        "حي العنبرية",
        "حي العوالي",
        "حي العيون",
        "حي المناخة",
        "حي الأغوات",
        "حي الساحة",
        "حي زقاق الطيار",
        "حي الحرة الشرقية",
        "حي التاجوري",
        "حي باب المجيدي",
        "حي باب الشامي",
        "حي الحرة الغربية",
        "حي الجرف",
        "حي الدويمة",
        "حي القبلتين",
        "حي أبيار علي",
        "حي الخالدية",
        "حي الاسكان",
        "حي المطار",
        "حي البيداء",
        "حي تلعة الهبوب",
        "حي المبعوث",
        "حي العاقول",
        "حي الخضراء",
        "حي وعيره",
        "حي الفيصل",
        "حي الحرة الشمالية الشرقية",
        "حي قربان",
        "حي المنشية",
        "حي السيح",
        "حي الوبرة",
        "حي عروة",
        "حي الدخل المحدود",
        "حي العصبة",
        "حي شوران",
        "حي الراية",
        "حي الفتح",
        "حي الحمراء",
        "حي أبو مرخه",
        "حي المصانع",
        ];
        foreach($districts_names as $district_name)
        {
            DB::table("distracts")->insert(["name"=>$district_name]);
        }
        // $this->call(UserSeeder::class);
    }
}
